In [10]:
# 모듈 로딩
import pandas as pd
import numpy as np

# 파일 관련 변수들
DIR='../Data/'
FILE=DIR+'titanic.csv'

titanic=pd.read_csv(FILE)

In [11]:
subDF=titanic.loc[:5, ['Age','Fare']]

In [12]:
subDF['Value']=10

In [19]:
# 사용자 정의 함수
def addValue(x):
    print(f'[DEBUG]--------\n{x}')
    return x+x

def addTwoValue(x, y):
    #print(f'[DEBUG]--------\n{x}, {y}')
    return x+y

In [14]:
# 사용자 정의 함수
def missingValueCheck(sr):
    print(f'[DEBUG]--------\n{sr}')
    return sr.isnull()

def missingValueSum(sr):
    print(f'[DEBUG]--------\n{sr}')
    return sr.isnull().sum()

In [17]:
subDF.applymap(np.sum)

    Age     Fare  Value
0  22.0   7.2500     10
1  38.0  71.2833     10
2  26.0   7.9250     10
3  35.0  53.1000     10
4  35.0   8.0500     10
5   NaN   8.4583     10

In [20]:
subDF.applymap(addValue)

[DEBUG]--------
22.0
[DEBUG]--------
38.0
[DEBUG]--------
26.0
[DEBUG]--------
35.0
[DEBUG]--------
35.0
[DEBUG]--------
nan
[DEBUG]--------
7.25
[DEBUG]--------
71.2833
[DEBUG]--------
7.925
[DEBUG]--------
53.1
[DEBUG]--------
8.05
[DEBUG]--------
8.4583
[DEBUG]--------
10
[DEBUG]--------
10
[DEBUG]--------
10
[DEBUG]--------
10
[DEBUG]--------
10
[DEBUG]--------
10

    Age      Fare  Value
0  44.0   14.5000     20
1  76.0  142.5666     20
2  52.0   15.8500     20
3  70.0  106.2000     20
4  70.0   16.1000     20
5   NaN   16.9166     20

In [21]:
subDF.pipe(addValue)   # 얘는 데이터프레임 전체가 들어감

[DEBUG]--------
    Age     Fare  Value
0  22.0   7.2500     10
1  38.0  71.2833     10
2  26.0   7.9250     10
3  35.0  53.1000     10
4  35.0   8.0500     10
5   NaN   8.4583     10

    Age      Fare  Value
0  44.0   14.5000     20
1  76.0  142.5666     20
2  52.0   15.8500     20
3  70.0  106.2000     20
4  70.0   16.1000     20
5   NaN   16.9166     20

In [22]:
subDF.pipe(np.sum)

Age      156.0000
Fare     156.0666
Value     60.0000
dtype: float64

자료형 -> category : 성별, Enbarked(탑승 지역명)
연속적인 데이터들 중(int64 중) category : Pclass, Survived

결측치 처리

연령대